In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [9]:
#lisons notre base de données
df= pd.read_csv('massarbd.csv')
df.head()

,Unnamed: 0,City,Colors Reported,Shape Reported,State,Time
0,0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
2,2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00

In [11]:
#verifions la taille de notre bd
df.shape

(18241, 6)

In [7]:
#faisons la statistique
df.describe()

         Unnamed: 0
count  18241.000000
mean    9120.000000
std     5265.867466
min        0.000000
25%     4560.000000
50%     9120.000000
75%    13680.000000
max    18240.000000

In [12]:
#verifions le type des chaques colonnes
df.dtypes

Unnamed: 0          int64
City               object
Colors Reported    object
Shape Reported     object
State              object
Time               object
dtype: object

In [18]:
# verifions certaines informations sur nos données
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18241 entries, 0 to 18240
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   City             18216 non-null  object
 1   Colors Reported  2882 non-null   object
 2   Shape Reported   15597 non-null  object
 3   State            18241 non-null  object
 4   Time             18241 non-null  object
dtypes: object(5)
memory usage: 712.7+ KB

In [23]:
#reperage des valeurs nulles ou manquantes
df.isna().sum().sort_values(ascending=False)

Colors Reported    15359
Shape Reported      2644
City                  25
State                  0
Time                   0
dtype: int64

In [26]:
#reperage des valeurs dupliqué
df.duplicated().sum()

109

In [27]:
df.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [32]:
df['Colors Reported'].isna().describe()

count     18241
unique        2
top        True
freq      15359
Name: Colors Reported, dtype: object

In [33]:
#Recherche de pourcentage des valeurs manquante sur la colonne Colors Reported
15359*100/18241

84.20042760813551

In [35]:
#supprimons la colonne color reported car sa frequance depasse 50%
del df['Colors Reported']

In [36]:
df.head()

                   City Shape Reported State             Time
0                Ithaca       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro          OTHER    NJ  6/30/1930 20:00
2               Holyoke           OVAL    CO  2/15/1931 14:00
3               Abilene           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair          LIGHT    NY  4/18/1933 19:00

In [40]:
#pour la colonne 'Shape Reported', remplacer les valeurs manquantes par la valeur par défaut ‘VARIOUS’
df['Shape Reported'].fillna('various', inplace =True)

In [42]:
df['Shape Reported'].isna().sum()

0

In [44]:
df.duplicated().sum()

149

In [45]:
df= df.drop_duplicates()

In [46]:
df.duplicated().sum()

0

In [48]:
df.describe()

           City Shape Reported  State              Time
count     18067          18092  18092             18092
unique     6476             28     52             16145
top     Seattle          LIGHT     CA  11/16/1999 19:00
freq        182           2784   2513                27

In [51]:
#Renommer les colonnes 'Shape Reported', 'Colors Reported' respectivement en
#Forme et Couleur
df.rename(columns={'Shape Reported':'Forme'},inplace=True)

/home/nassir/anaconda3/lib/python3.8/site-packages/pandas/core/frame.py:5039: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().rename(

In [53]:
#reindexer
colonnes=['City', 'Forme','State','Time']
data=df[colonnes]

In [54]:
data.head()

                   City     Forme State             Time
0                Ithaca  TRIANGLE    NY   6/1/1930 22:00
1           Willingboro     OTHER    NJ  6/30/1930 20:00
2               Holyoke      OVAL    CO  2/15/1931 14:00
3               Abilene      DISK    KS   6/1/1931 13:00
4  New York Worlds Fair     LIGHT    NY  4/18/1933 19:00